#include <stdio.h>

int main() {
    float speed, distance, time;
    
    printf("Введіть пройдений шлях (км): ");
    scanf("%f", &distance);
    
    printf("Введіть час руху (год): ");
    scanf("%f", &time);
    
    speed = distance / time;
    
    printf("Швидкість автомобіля: %.2f км/год\n", speed);
    printf("Пройдений шлях: %.2f км\n", distance);
    
    return 0;
}

При запуску програма спочатку просить ввести пройдений шлях у кілометрах та час руху у годинах. Після цього вона розраховує швидкість автомобіля, яка виводиться на екран разом з пройденим шляхом. Швидкість в
