#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main() {
    float num, sum = 0, avg;
    float max = -999999999; // початкове значення максимального числа
    char input[256]; // буфер для зчитування введення

    printf("Введіть послідовність чисел (введіть пустий рядок, щоб закінчити):\n");

    while (1) { // безкінечний цикл
        fgets(input, 256, stdin); // зчитуємо введення

        if (strlen(input) <= 1) { // якщо введено пустий рядок, то програма завершується
            break;
        }

        num = atof(input); // перетворюємо введення у число

        if (num > max) { // якщо поточне число більше за максимальне, то максимальне змінюється
            max = num;
        }

        sum += num; // додаємо поточне число до суми
    }

    avg = sum / 2; // розраховуємо середнє арифметичне

    printf("Середнє арифметичне: %.2f\n", avg);
    printf("Максимальне число: %.2f\n", max);

    return 0;
}
